       IDENTIFICATION DIVISION. 
       PROGRAM-ID. TRADER-REPORT.
       AUTHOR. HEX (62160246)
       ENVIRONMENT DIVISION. 
       INPUT-OUTPUT SECTION.
       FILE-CONTROL. 
           SELECT TRADER-DATA-FILE ASSIGN TO "trader6.dat"
              ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION. 
       FD  TRADER-DATA-FILE.
       01  TRADER-RECORD.
           88 END-OF-TRADER-FILE
           .
       05  PROVINCE-ID PIC 9(2).
           05 TRADER-ID PIC 9(4).
           05 TRADER-PROFIT  PIC 9(6).
       WORKING-STORAGE SECTION.
       
       PROCEDURE DIVISION.
       MAIN.
           OPEN INPUT TRADER-DATA-FILE
           READ TRADER-DATA-FILE 
           AT END SET END-OF-TRADER-FILE TO TRUE
           END-READ
           .