       IDENTIFICATION DIVISION. 
       PROGRAM-ID. TRADER-REPORT.
       AUTHOR. HEX (62160246)
       ENVIRONMENT DIVISION. 
       INPUT-OUTPUT SECTION.
       FILE-CONTROL. 
           SELECT TRADER-DATA-FILE ASSIGN TO "trader6.dat"
              ORGANIZATION IS LINE SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION. 
       FD  TRADER-DATA-FILE.
       01  TRADER-RECORD.
           88 END-OF-TRADER-FILE VALUE HIGH-VALUES 
           .
       05  PROVINCE-ID PIC 9(2).
           05 TRADER-ID PIC 9(4).
           05 TRADER-PROFIT  PIC 9(6).
       WORKING-STORAGE SECTION.
       01  PROVINCE-TABLE.
           05 PROVINCE-TOTAL OCCURS 77 TIMES.
              10 PROVINCE-PROFIT-TOTAL   PIC 9(9).
       PROCEDURE DIVISION.
       MAIN.

      *    READ FILE.
           OPEN INPUT TRADER-DATA-FILE
           READ TRADER-DATA-FILE 
           AT END 
              SET END-OF-TRADER-FILE TO TRUE
           END-READ

      *    LOOP TRADER DATA.    
           PERFORM UNTIL END-OF-TRADER-FILE 
      *    TODO: ASSIGN TO ARRAY HERE
              ADD TRADER-PROFIT TO PROVINCE-PROFIT-TOTAL(PROVINCE-ID)
      *       THIS LIKE A READ NEXT LINE IN JAVA ...
              READ TRADER-DATA-FILE
              AT END
                 SET END-OF-TRADER-FILE TO TRUE
              END-READ 
           END-PERFORM

           .